/* Создать класс и объекты описывающие Банкомат. Набор купюр находящихся в
банкомате должен задаваться тремя свойствами: количеством купюр номиналом 20
50 100. Сделать методы для добавления денег в банкомат. Сделать функцию
снимающую деньги. На вход передается сумма денег. На выход – булевское
значение (операция удалась или нет). При снятии денег функция должна
рапечатывать каким количеством купюр какого номинала выдается сумма. Создать
конструктор с тремя параметрами – количеством купюр.*/

//import java.util.Scanner;
//
//class ATM{
//    private int k2,k5,k10;//Количество
//
//    ATM(int купюры20,int купюры50 ,int купюры100){ //Количество
//        this.k2=купюры20;
//        this.k5=купюры50;
//        this.k10=купюры100;
//    }
//
//
//
//
//
//}
//
//public class Task25 {
//    public static void main(String[] args) {
//    ATM atm=new ATM(100,100,100);
//        Scanner sc=new Scanner();
//    }
//}
